app/controllers/customers_controller.rb

  def index

    if current_user.admin?
        @customers = Customer.all
---
SELECT `customers`.* FROM `customers`

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("first_name", "last_name", "address", "contact", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Kiran"], ["last_name", "Kiran"], ["address", "Pokhara"], ["contact", 9840], ["created_at", "2016-04-29 04:38:17.028959"], ["updated_at", "2016-04-29 04:38:17.028959"]]

  def update
    respond_to do |format|
      if @customer.update(customer_params)
---
UPDATE "customers" SET "contact" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["contact", 984032], ["updated_at", "2016-04-29 04:43:59.342387"], ["id", 2]]

    def set_customer
      @customer = Customer.find(params[:id])
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = ? LIMIT 1  [["id", 2]]