app/controllers/dealers_controller.rb

SELECT `dealers`.* FROM `dealers`
---
  def index

    if current_user.admin?
        @dealers = Dealer.all

INSERT INTO `dealers` (`dealer_name`, `address`, `email`, `contact`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?)  [["dealer_name", "dfdsga"], ["address", "gdsgas"], ["email", "gdsagas"], ["contact", 321], ["created_at", "2017-01-17 15:55:25"], ["updated_at", "2017-01-17 15:55:25"]]
---
  def create
    @dealer = Dealer.new(dealer_params)

    respond_to do |format|
      if @dealer.save

SELECT  `dealers`.* FROM `dealers` WHERE `dealers`.`id` = ? LIMIT 1  [["id", 1]]
---
    def set_dealer
      @dealer = Dealer.find(params[:id])