app/controllers/guitars_controller.rb

  def index
        @guitars = Guitar.all
---
SELECT "guitars".* FROM "guitars"  ORDER BY created_at_DESC

  def create
    @guitar = Guitar.new(guitar_params)

    respond_to do |format|
      if @guitar.save
---
INSERT INTO "guitars" ("guitar_name", "guitar_make", "guitar_model", "guitar_color", "purposed_selling_price", "damaged_status", "rack_no", "quantity", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @guitar.update(guitar_params)
---
UPDATE "guitars" SET "guitar_name" = ?, "guitar_make" = ?, "guitar_model" = ?, "guitar_color" = ?, "purposed_selling_price" = ?, "damaged_status" = ?, "rack_no" = ?, "quantity" = ?, "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "guitars"."id" = ?

  def destroy
    @guitar.destroy
---
DELETE FROM "guitars" WHERE "guitars"."id" = ?  [["id", 1]]

    def set_guitar
      @guitar = Guitar.find(params[:id])
---
SELECT  `guitars`.* FROM `guitars` WHERE `guitars`.`id` = ? LIMIT 1  [["id", 9]]