app/controllers/purchase_orders_controller.rb

  def index

    if current_user.admin?
        @purchase_orders = PurchaseOrder.all
---
SELECT `purchase_orders`.* FROM `purchase_orders`

  def create
    @purchase_order = PurchaseOrder.new(purchase_order_params)

    respond_to do |format|
      if @purchase_order.save
---
INSERT INTO "purchase_orders" ("make", "purchaseDate", "delivaryDate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["make", ""], ["purchaseDate", "2016-04-28"], ["delivaryDate", "2016-04-28"], ["created_at", "2016-04-28 04:31:46.445392"], ["updated_at", "2016-04-28 04:31:46.445392"]]

  def update
    respond_to do |format|
      if @purchase_order.update(purchase_order_params)
---
UPDATE "purchase_orders" SET "SupplierName" = ?, "updated_at" = ? WHERE "purchase_orders"."id" = ?  [["SupplierName", "Sona Music Palace"], ["updated_at", "2016-04-29 03:02:57.721522"], ["id", 2]]

  def destroy
    @purchase_order.destroy
---
DELETE FROM "purchase_orders" WHERE "purchase_orders"."id" = ?  [["id", 1]]

    def set_purchase_order
      @purchase_order = PurchaseOrder.find(params[:id])
---
SELECT  `purchase_orders`.* FROM `purchase_orders` WHERE `purchase_orders`.`id` = ? LIMIT 1  [["id", 4]]