app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index

    if current_user.admin?
        @users = User.all

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
  	@user = User.new(user_params.merge(password_confirmation: user_params[:password]))
  	if @user.save